[
  "Hotel-Request+Area*?",
  "Hotel-Inform+Parking*yes",
  "Booking-Inform+none*none",
  "Hotel-Inform+Parking*none",
  "Booking-Request+Stay*?",
  "Booking-Request+Day*?",
  "general-reqmore+none*none",
  "general-bye+none*none",
  "Police-Inform+none*none",
  "Police-Request+Post*?",
  "Police-Request+Addr*?",
  "general-thank+none*none",
  "general-welcome+none*none",
  "Train-Request+Depart*?",
  "Train-Request+Day*?",
  "Hotel-Inform+Internet*yes",
  "Police-Request+Phone*?",
  "general-greet+none*none",
  "Hotel-Inform+Internet*no",
  "Hotel-Request+Price*?",
  "Hotel-Inform+Internet*none",
  "Hotel-Inform+Price*dontcare",
  "Hotel-Request+Addr*?",
  "Train-Request+Dest*?",
  "Train-Request+Leave*?",
  "Train-Request+Arrive*?",
  "Train-Inform+Arrive*dontcare",
  "Train-Inform+Leave*dontcare",
  "Train-OfferBook+none*none",
  "Train-Request+Time*?",
  "Train-Request+Ticket*?",
  "Hotel-Request+Internet*?",
  "Hotel-Request+Parking*?",
  "Hotel-Request+Ref*?",
  "Attraction-Inform+none*none",
  "Attraction-Request+Area*?",
  "Attraction-Request+Type*?",
  "Attraction-Request+Addr*?",
  "Restaurant-Request+Food*?",
  "Restaurant-Request+Area*?",
  "Restaurant-Request+Phone*?",
  "Restaurant-Request+Post*?",
  "Restaurant-Request+Addr*?",
  "Hospital-Inform+none*none",
  "Hospital-Request+Department*?",
  "Hospital-Request+Phone*?",
  "Attraction-Request+Post*?",
  "Attraction-Request+Phone*?",
  "Hospital-Request+Addr*?",
  "Hospital-Request+Post*?",
  "Booking-NoBook+none*none",
  "Train-Inform+none*none",
  "Train-Request+People*?",
  "Booking-Request+People*?",
  "Hotel-Request+Stars*?",
  "Hotel-Request+Type*?",
  "Hotel-Select+none*none",
  "Hotel-Request+Post*?",
  "Attraction-Request+Fee*?",
  "Restaurant-Request+Price*?",
  "Restaurant-Inform+Food*dontcare",
  "Train-Request+Ref*?",
  "Booking-Request+Time*?",
  "Hotel-Request+Phone*?",
  "Attraction-Request+Price*?",
  "Restaurant-Inform+none*none",
  "Hotel-Inform+none*none",
  "Train-Select+none*none",
  "Restaurant-Select+none*none",
  "Restaurant-Request+Ref*?",
  "Taxi-Inform+none*none",
  "Taxi-Request+Depart*?",
  "Train-Request+Id*?",
  "Attraction-NoOffer+none*none",
  "Hotel-Recommend+Internet*none",
  "Hotel-Recommend+Parking*none",
  "Taxi-Request+Dest*?",
  "Booking-Book+none*none",
  "Attraction-Select+none*none",
  "Taxi-Request+Phone*?",
  "Hotel-Inform+Area*dontcare",
  "Taxi-Request+Arrive*?",
  "Taxi-Request+Car*?",
  "Attraction-Request+Name*?",
  "Taxi-Request+Leave*?",
  "Restaurant-NoOffer+none*none",
  "Taxi-Inform+Arrive*none",
  "Train-NoOffer+none*none",
  "Hotel-NoOffer+none*none",
  "Restaurant-Inform+Area*dontcare",
  "Attraction-Inform+Area*dontcare",
  "Hotel-Inform+Internet*dontcare",
  "Restaurant-Inform+Price*dontcare",
  "Hotel-Recommend+none*none",
  "Attraction-Inform+Type*dontcare",
  "Hotel-Inform+Parking*no",
  "Hotel-Request+Name*?",
  "Hotel-NoOffer+Internet*none",
  "Attraction-Recommend+none*none",
  "Hotel-Inform+Stars*dontcare",
  "Hotel-NoOffer+Parking*none",
  "Hotel-Inform+Stay*none",
  "Restaurant-Request+Name*?",
  "Train-Inform+Leave*none",
  "Hotel-Inform+Parking*dontcare",
  "Hotel-Inform+Type*none",
  "Hotel-Inform+Area*none",
  "Hotel-Inform+Price*none",
  "Hotel-Select+Parking*none",
  "Hotel-Select+Internet*none",
  "Train-OfferBooked+none*none",
  "Attraction-Inform+Name*dontcare",
  "Taxi-Inform+Depart*none",
  "Restaurant-Inform+Area*none",
  "Restaurant-Inform+Food*none",
  "Train-Inform+Depart*none",
  "Hotel-Inform+Name*none",
  "Restaurant-Recommend+none*none",
  "Hotel-Inform+Day*none",
  "Attraction-Inform+Type*none",
  "Restaurant-Inform+Price*none",
  "Taxi-Inform+Dest*none",
  "Attraction-Inform+Area*none",
  "Train-Inform+Dest*none",
  "Attraction-Inform+Fee*none",
  "Hotel-Inform+Type*dontcare",
  "Hotel-Inform+Stars*none",
  "Taxi-Inform+Leave*dontcare",
  "Taxi-Inform+Leave*none",
  "Train-Inform+People*dontcare",
  "Train-Inform+People*none",
  "Attraction-Inform+Name*none",
  "Hotel-Inform+Name*dontcare",
  "Train-Inform+Day*none",
  "Booking-Book+Ref*none",
  "Hotel-Inform+Day*dontcare",
  "Train-Inform+Arrive*none"
]